<?php
// *	@source		See SOURCE.txt for source and other copyright.
// *	@license	GNU General Public License version 3; see LICENSE.txt

// Heading
$_['heading_title']    							= 'Корзина покупок';

// Text
$_['text_success']    							= 'Товар <a href="%s">%s</a> добавлен в <a href="%s">корзину покупок</a>!';
$_['text_remove']      							= 'Корзина покупок обновлена!';
$_['text_login']      							= 'Необходимо <a href="%s">Войти в Личный кабинет</a> или <a href="%s">создать учетную запись</a> для просмотра цен!';
$_['text_points']      							= 'Бонусные баллы: %s';
$_['text_next']        							= 'Воспользуйтесь дополнительными возможностями';
$_['text_next_choice'] 							= 'Если у вас есть код купона на скидку или бонусные баллы, которые вы хотите использовать, выберите соответствующий пункт. Также можно приблизительно узнать стоимость доставки в ваш регион.';
$_['text_empty']       							= 'Ваша корзина пуста!';
$_['text_day']         							= 'День';
$_['text_week']        							= 'Неделя';
$_['text_semi_month']  							= 'Полмесяца';
$_['text_month']       							= 'Месяц';
$_['text_year']        							= 'Год';
$_['text_trial']       							= 'Стоимость: %s; Периодичность: %s %s; Кол-во платежей: %s; Далее, ';
$_['text_recurring']   							= 'Стоимость: %s; Периодичность: %s %s';
$_['text_length']      							= 'Кол-во платежей: %s';
$_['text_until_cancelled']   					= 'до отмены';
$_['text_recurring_item']    	              	= 'Периодические платежи';
$_['text_payment_recurring']                    = 'Платежный профиль';
$_['text_trial_description'] 	              	= 'Стоимость: %s; Периодичность: %d %s; Кол-во платежей: %d;  Далее,  ';
$_['text_payment_description'] 	              	= 'Стоимость: %s; Периодичность: %d %s; Кол-во платежей: %d';
$_['text_payment_until_canceled_description'] 	= 'Стоимость: %s; Периодичность: %d %s; Кол-во платежей: до отмены';

// Column
$_['column_image']          					= 'Изображение';
$_['column_name']           					= 'Название товара';
$_['column_model']          					= 'Код товара';
$_['column_quantity']       					= 'Количество';
$_['column_price']          					= 'Цена за единицу товара';
$_['column_total']          					= 'Всего';

// Error
$_['error_stock']            					= 'Товары, отмеченные ***, недоступны в нужном количестве или отсутствуют на складе!';
$_['error_minimum']          					= 'Минимальное количество для заказа товара %s составляет %s!';
$_['error_required']         					= '%s необходим!';
$_['error_product']          					= 'Ваша корзина пуста!';
$_['error_recurring_required'] 					= 'Необходимо выбрать периодичность платежа!';

/**
 * ================= Мои настройки
 */

$_['text_items']       							= '%s';
$_['text_curr']       							= '%s';
$_['cart_title'] = 'Корзина';
$_['cart_empty'] = 'Ваша корзина пуста';
$_['go_back'] = 'Обратно в магазин';
$_['text_not_checked'] = 'Не выбрано';

$_['error_name']               = 'Имя должно содержать от 3 до 25 символов!';
$_['error_company']               = 'Название компании должно содержать от 3 до 25 символов!';
$_['error_legal_address']               = 'Адресс должен содержать от 3 до 25 символов!';
$_['error_country']               = 'Название страны должно содержать от 3 до 25 символов!';
$_['error_region']               = 'Название области должно содержать от 3 до 25 символов!';
$_['error_town']               = 'Название города должно содержать от 3 до 25 символов!';
$_['error_index']               = 'Индекс должен содержать от 3 до 25 символов!';
$_['error_street']               = 'Название улицы должно содержать от 3 до 25 символов!';
$_['error_build']               = 'Поле дом должно содержать от 1 до 25 символов!';
$_['error_housing']               = 'Поле корпус должно содержать от 1 до 25 символов!';
$_['error_apartment']               = 'Поле квартира должно содержать от 1 до 25 символов!';
$_['error_comment']               = 'Текст сообщения должен содержать от 5 до 1000 символов!';
$_['error_phone']               = 'Телефон должен содержать от 8 символов';
$_['error_email']    = 'E-Mail адрес введен неверно!';
$_['error_confirm']    = 'Ознакомтесь с нашими Общими условиями';
$_['nat_persone']    = 'Физическое лицо';
$_['legal_persone']    = 'Юридическое лицо';
$_['self_shipping']    = 'Самовывоз из магазина';
$_['omnivia_shipping']    = 'OMNIVA';
$_['latvia_pasts_shipping']    = 'Latvijas Pasts';
$_['courier_shipping']    = 'Курьер';
$_['pasta_shipping']    = 'Pasta Stacija';
/*
 * ====================== INPUTS
 * */
$_['text_name']    = 'ФИО';
$_['text_email']    = 'Почта';
$_['text_company']    = 'Название компании';
$_['text_phone']    = 'Телефон';
$_['text_country']    = 'Страна';
$_['text_region']    = 'Область';
$_['text_town']    = 'Город';
$_['text_street']    = 'Улица';
$_['text_build']    = 'Дом';
$_['text_housing']    = 'Корпус';
$_['text_apartment']    = 'Квартира';
$_['text_comment']    = 'Коментарий';
$_['text_confirm']    = 'Я прочитал Общие Условия и согласен с условиями';
$_['text_postcode']    = 'Почтовый индекс';
$_['text_legal']    = 'Юридический  адрес';
$_['text_send']    = 'Отправить';